app/Controllers/AuthController.php

    public function process() {
        $model = new UserModel();
        $user = $model->where('username', $this->request->getPost('username'))->first();
---
SELECT *
FROM `users`
WHERE `username` = 'sales'
 LIMIT 1