app/Controllers/JenisBahanController.php

SELECT *
FROM `jenis_bahan`
---
    public function index()
    {
        $data = ['bahan' => $this->jenisBahanModel->findAll()];

SELECT *
FROM `kriteria`
SELECT *
FROM `jenis_bahan`
WHERE `jenis_bahan`.`id_jenis_bahan` = '3'
SELECT COUNT(*) AS `numrows`
FROM `nilai_kriteria_bahan`
WHERE `id_jenis_bahan` = '3'
---
    public function setup($id_bahan)
    {
        $bahan = $this->jenisBahanModel->find($id_bahan);
        $kriteria = $this->kriteriaModel->findAll();
        $sub = $this->subKriteriaModel->getSubLengkap();

        // Cek status kelengkapan data (untuk UI)
        $statusKriteria = $this->nilaiKriteriaBahanModel->where('id_jenis_bahan', $id_bahan)->countAllResults() > 0;