app/Controllers/JenisBahanController.php

SELECT *
FROM `supplier`
---
    public function setupSupplier($id_bahan, $id_sub)
    {
        $bahan = $this->jenisBahanModel->find($id_bahan);
        $sub = $this->subKriteriaModel->find($id_sub);
        $suppliers = $this->supplierModel->findAll();