app/Controllers/MasterController.php

    public function kriteria()
    {
        $data = ['kriteria' => $this->kriteriaModel->findAll()];
---
SELECT *
FROM `kriteria`

    public function prioritasKriteria()
    {
        $kriteria = $this->kriteriaModel->findAll();
---
SELECT *
FROM `kriteria`

    public function supplier()
    {
        $data = ['supplier' => $this->supplierModel->findAll()];
---
SELECT *
FROM `supplier`