app/Controllers/PemesananController.php

    public function create()
    {
        $data = ['bahan_list' => $this->jenisBahanModel->findAll()];
---
SELECT *
FROM `jenis_bahan`

    private function hitungRekomendasi($id_bahan)
    {
        $suppliers = $this->supplierModel->findAll();
        $leaderboard = [];

        // 1. Ambil Bobot Global Sub Kriteria dari MASTER (Static)
        // Pastikan kolom 'bobot_global' ada di tabel sub_kriteria
        $allSubs = $this->subKriteriaModel->findAll();

        // 2. Ambil Skor Supplier untuk Bahan ini (Dynamic)
        $skorData = $this->nilaiSupplierBahanModel
            ->where('id_jenis_bahan', $id_bahan)
            ->findAll();
---
SELECT *
FROM `supplier`
SELECT *
FROM `sub_kriteria`
SELECT *
FROM `jenis_bahan`
WHERE `jenis_bahan`.`id_jenis_bahan` = '1'
SELECT *
FROM `nilai_supplier_bahan`
WHERE `id_jenis_bahan` = '1'

    public function store()
    {
        $id_bahan = $this->request->getPost('id_jenis_bahan');

        // 1. Simpan Data Pesanan Utama
        $this->pesananModel->save([
            'id_jenis_bahan' => $id_bahan,
            'jumlah_lusin' => $this->request->getPost('jumlah_lusin'),
            'id_supplier' => $this->request->getPost('id_supplier'), // Supplier yang dipilih user (bisa jadi bukan ranking 1)
            'catatan' => $this->request->getPost('catatan'),
            'tanggal' => date('Y-m-d H:i:s')
        ]);

        $id_pesanan = $this->pesananModel->getInsertID();

        // 2. Simpan Snapshot Leaderboard (History AHP)
        // Kita hitung ulang saat itu juga untuk disimpan sebagai bukti sejarah
        $leaderboard = $this->hitungRekomendasi($id_bahan);

        foreach($leaderboard as $rank => $row) {
            // Index array mulai dari 0, jadi ranking = index + 1
            $ranking = $rank + 1;

            $this->pesananHistoryAhpModel->save([
                'id_pesanan' => $id_pesanan,
                'id_supplier' => $row['id_supplier'],
                'skor_ahp' => $row['skor_akhir'],
                'ranking' => $ranking
            ]);
---
INSERT INTO `pesanan` (`id_jenis_bahan`, `jumlah_lusin`, `id_supplier`, `catatan`, `tanggal`) VALUES ('1', '12', '2', '12123', '2026-01-23 07:48:43')
INSERT INTO `pesanan_history_ahp` (`id_pesanan`, `id_supplier`, `skor_ahp`, `ranking`) VALUES (2, '2', 0.17968934, 1)

    public function detail($id)
    {
        // Custom query karena kita butuh join lengkap
        $pesanan = $this->db->table('pesanan')
            ->select('pesanan.*, supplier.nama as nama_supplier, jenis_bahan.nama_bahan')
            ->join('supplier', 'supplier.id_supplier = pesanan.id_supplier')
            ->join('jenis_bahan', 'jenis_bahan.id_jenis_bahan = pesanan.id_jenis_bahan')
            ->where('id_pesanan', $id)
            ->get()->getRowArray();
---
SELECT `pesanan`.*, `supplier`.`nama` as `nama_supplier`, `jenis_bahan`.`nama_bahan`
FROM `pesanan`
JOIN `supplier` ON `supplier`.`id_supplier` = `pesanan`.`id_supplier`
JOIN `jenis_bahan` ON `jenis_bahan`.`id_jenis_bahan` = `pesanan`.`id_jenis_bahan`
WHERE `id_pesanan` = '2'

    public function debug($id_bahan)
    {
        $suppliers = $this->supplierModel->findAll();
        $allSubs = $this->subKriteriaModel->findAll();

        // Ambil Skor dari Database
        $skorData = $this->nilaiSupplierBahanModel
            ->where('id_jenis_bahan', $id_bahan)
            ->findAll();
---
SELECT *
FROM `supplier`
SELECT *
FROM `sub_kriteria`
SELECT *
FROM `nilai_supplier_bahan`
WHERE `id_jenis_bahan` = '1'