app/Controllers/PemesananController.php

    public function store()
    {
        // 1. Simpan Transaksi Pesanan
        $dataPesanan = [
            'jumlah_lusin' => $this->request->getPost('jumlah_lusin'),
            'bahan_baku' => $this->request->getPost('bahan_baku'),
            'catatan' => $this->request->getPost('catatan'),
            'id_supplier_terpilih' => $this->request->getPost('id_supplier_terpilih'), // User memilih berdasarkan rekomendasi
            'tanggal' => date('Y-m-d H:i:s')
        ];

        $this->pesananModel->insert($dataPesanan);
---
INSERT INTO `pesanan` (`id_pembeli`, `nama_barang`, `id_jenis_bahan`, `jumlah_lusin`, `total_berat`, `total_harga`, `catatan`, `status`, `tanggal`) VALUES ('1', '1afawffaw', '1', '12', 32.4, 204000, 'dwda', 'pending', '2026-01-23 09:07:09')

    private function hitungLeaderboardSaatIni()
    {
        $suppliers = $this->supplierModel->findAll();
        $subs = $this->subKriteriaModel->findAll();
---
SELECT *
FROM `supplier`
SELECT *
FROM `sub_kriteria`