app/Controllers/PemesananController.php

    public function create() {
        return view('pemesanan/create', [
            'bahan' => $this->jenisBahanModel->findAll(),
            'pembeli' => $this->pembeliModel->findAll()
---
SELECT *
FROM `pembeli`