app/Controllers/PengadaanController.php

SELECT *
FROM `supplier`
SELECT *
FROM `sub_kriteria`
SELECT *
FROM `nilai_supplier_bahan`
WHERE `id_jenis_bahan` = '1'
---
    public function getLeaderboard($id_bahan) {
        $suppliers = $this->supplierModel->findAll();
        $leaderboard = [];
        $allSubs = $this->subKriteriaModel->findAll();
        $skorData = $this->nilaiSupplierBahanModel->where('id_jenis_bahan', $id_bahan)->findAll();