app/Controllers/SupplierController.php

    public function index()
    {
        // Ambil data sub kriteria untuk dropdown menu "Nilai Supplier"
        $subs = $this->subKriteriaModel->getSubWithKriteria();

        $data = [
            'supplier' => $this->supplierModel->findAll(),
            'subs' => $subs,
            'validation' => \Config\Services::validation()
        ];
---
SELECT *
FROM `supplier`