app/Models/NilaiSubBahanModel.php

    public function getBobotByBahan($id_bahan) {
        return $this->where('id_jenis_bahan', $id_bahan)->findAll();
---
SELECT *
FROM `nilai_sub_bahan`
WHERE `id_jenis_bahan` = '3'