app/Models/PesananHistoryAhpModel.php

SELECT `pesanan_history_ahp`.*, `supplier`.`nama` as `nama_supplier`
FROM `pesanan_history_ahp`
JOIN `supplier` ON `supplier`.`id_supplier` = `pesanan_history_ahp`.`id_supplier`
WHERE `id_pesanan` = '2'
ORDER BY `ranking` ASC
---
    public function getSnapshot($id_pesanan)
    {
        return $this->select('pesanan_history_ahp.*, supplier.nama as nama_supplier')
                    ->join('supplier', 'supplier.id_supplier = pesanan_history_ahp.id_supplier')
                    ->where('id_pesanan', $id_pesanan)
                    ->orderBy('ranking', 'ASC')
                    ->findAll();