app/Models/PesananModel.php

    public function getPesananLengkap($status = null) {
        // ... (Kode sama seperti sebelumnya) ...
        $builder = $this->select('pesanan.*, jenis_bahan.nama_bahan, pembeli.nama_pembeli, supplier.nama as nama_supplier')
                        ->join('jenis_bahan', 'jenis_bahan.id_jenis_bahan = pesanan.id_jenis_bahan')
                        ->join('pembeli', 'pembeli.id_pembeli = pesanan.id_pembeli')
                        ->join('supplier', 'supplier.id_supplier = pesanan.id_supplier', 'left');

        if($status) {
            $builder->where('pesanan.status', $status);
        }

        return $builder->orderBy('tanggal', 'DESC')->findAll();
---
SELECT `pesanan`.*, `jenis_bahan`.`nama_bahan`, `pembeli`.`nama_pembeli`, `supplier`.`nama` as `nama_supplier`
FROM `pesanan`
JOIN `jenis_bahan` ON `jenis_bahan`.`id_jenis_bahan` = `pesanan`.`id_jenis_bahan`
JOIN `pembeli` ON `pembeli`.`id_pembeli` = `pesanan`.`id_pembeli`
LEFT JOIN `supplier` ON `supplier`.`id_supplier` = `pesanan`.`id_supplier`
WHERE `pesanan`.`status` = 'pending'
ORDER BY `tanggal` DESC