app/Models/SubKriteriaModel.php

SELECT `sub_kriteria`.*, `kriteria`.`nama` as `nama_kriteria`
FROM `sub_kriteria`
JOIN `kriteria` ON `kriteria`.`id_kriteria` = `sub_kriteria`.`id_kriteria`
---
    public function getSubWithKriteria()
    {
        return $this->select('sub_kriteria.*, kriteria.nama as nama_kriteria')
                    ->join('kriteria', 'kriteria.id_kriteria = sub_kriteria.id_kriteria')
                    ->findAll();